/*
//Задача №1

Console.Write("Введите число a: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число b: ");
int b = Convert.ToInt32(Console.ReadLine());

if (a>b)
{
Console.WriteLine("Число a большее");
Console.WriteLine("Число b меньшее");
}

else
{
Console.WriteLine("Число b большее");
Console.WriteLine("Число a меньшее");
}
*/

/*
//Задача №2

Console.Write("Введите число a: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число b: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число с: ");
int c = Convert.ToInt32(Console.ReadLine());

if (a>b) 
{
    if (a>c)
    {
    Console.WriteLine("Максимальное число a");
    }
}
if (b>a)
{
    if (b>c)
    {   
    Console.WriteLine("Максимальное число b");
    }
}

if (c>a)
{
    if (c>b)
    {   
    Console.WriteLine("Максимальное число c");
    }
}

*/

/*
//Алтернативное решение задачи №2

Console.Write("Введите число a: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число b: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число с: ");
int c = Convert.ToInt32(Console.ReadLine());

if((a>b) && (a>c))
{   
    Console.WriteLine("Максимальное число a");
    }
if((b>a) && (b>c))
{   
    Console.WriteLine("Максимальное число b");
    }
if((c>a) && (c>b))
{   
    Console.WriteLine("Максимальное число c");
    }
*/


